Revit 2024 API
ViewNode.ViewId Property
 The Id of the view element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId ViewId { get; }
Visual Basic
Public ReadOnly Property ViewId As ElementId
	Get
Visual C++
public:
property ElementId^ ViewId {
	ElementId^ get ();
}
See Also
ViewNode Class
Autodesk.Revit.DB Namespace